# -------------------------
# Homebrew bundle file
# -------------------------
#
# Install missing formulae/casks, skip anything already installed, leave extra packages alone (by default)
# Run `brew bundle` on target machine
# 
# Run `brew bundle --cleanup` if you want to uninstall anything not listed in the Brewfile—great for fresh setups, risky for daily use.
# 
# To update Brewfile (manually) after installs:
# `brew bundle dump --force && git commit -am "Update Brewfile" && git push`
# 
# To update Brewfile (dynamically):
# Use cron or launchd to:
# -	Pull repo
# -	Run brew bundle
# -	Works well for a “main laptop → secondary laptop” setup

# Improved shell history for zsh, bash, fish and nushell
# brew "atuin"

# Light UNIX download accelerator
# brew "axel"

# B2 Cloud Storage Command-Line Tools
brew "b2-tools"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# The modern Terminal UI for managing Homebrew packages and casks on macOS and Linux.
# brew "Valkyrie00/homebrew-bbrew/bbrew"

# New way to see and navigate directory trees
# brew "broot"

# OpenAI's coding agent that runs in your terminal
brew "codex"

# Container runtimes on MacOS (and Linux) with minimal setup
# brew "colima"
# 
# To run/create a virtual machine (for development), run:
# ```
# colima start --cpu 4 --memory 6 --disk 100 --vm-type=vz --mount-type=virtiofs --dns=1.1.1.1
# ```

# Dependency Manager for PHP
brew "composer"

# Create and run Linux containers using lightweight virtual machines
brew "container"

# Manage Apple Container with Docker Compose files
brew "container-compose"

# Get a file from an HTTP, HTTPS or FTP server
brew "curl"

# Load/unload environment variables based on $PWD
brew "direnv"

# Pack, ship and run any application as a lightweight container
brew "docker"

# Bash, Zsh and Fish completion for Docker
# brew "docker-completion"

# CLI for interacting with Doppler secrets and configuration
# brew "doppler"

# Modern, maintained replacement for ls
brew "eza"

# Like neofetch, but much faster because written mostly in C
brew "fastfetch"

# Simple, fast and user-friendly alternative to find
brew "fd"

# Play, record, convert, and stream audio and video
# brew "ffmpeg"

# Command-line fuzzy finder written in Go
# brew "fzf"

# GitHub command-line tool
brew "gh"

# Distributed revision control system
brew "git"

# Git extension for versioning large files
brew "git-lfs"

# GNU Privacy Guard (OpenPGP
# brew "gnupg"

# Post-modern modal text editor
# brew "helix"

# GNU utilities for networking
# brew "inetutils"

# Lightweight and flexible command-line JSON processor
# brew "jq"

# Terminal UI for Apple Containers
brew "lazycontainer"

# Linux virtual machines
# brew "lima"
# 
# To run/create a virtual machine (for development), run:
# ```
# limactl create --name=default --vm-type=vz --mount-type=virtiofs --mount-writable --memory=6 --cpus=4 --disk=100 template://docker
# docker context create lima-default --docker "host=unix://$HOME/.lima/default/sock/docker.sock"
# docker context use lima-default
# ```

# Access large language models from the command-line
brew "llm"

# Simple tool to make locally trusted development certificates
brew "mkcert"

# Free (GNU) replacement for the Pico text editor
brew "nano"

# Improved Nano Syntax Highlighting Files
# brew "nanorc"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Open-source, cross-platform JavaScript runtime environment
# brew "node"  # or brew "node@25"
# brew "node@24"

# Node.js version manager
# brew "nodenv"

# Node.js virtual environment builder
# brew "nodeenv"

# Swiss-army knife of markup format conversion
# brew "pandoc"

# Password manager
# brew "pass"

# Python version management
# brew "pyenv"

# Interpreted, interactive, object-oriented programming language
# brew "python"
# brew "python@3.14"

# Pack repository contents into a single AI-friendly file
brew "repomix"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"

# Command-line interface for https://speedtest.net bandwidth tests
# brew "speedtest-cli"

# Organize software neatly under a single directory tree (e.g. /usr/local)
# brew "stow"

# Terminal multiplexer
# brew "tmux"

# Extremely fast Python package installer and resolver, written in Rust
# brew "uv"

# Internet file retriever
# brew "wget"

# Feature-rich command-line audio/video downloader
brew "yt-dlp"

# Shell extension to navigate your filesystem faster
brew "zoxide"

# Zsh configuration
brew "zsh-autosuggestions"
brew "zsh-autocomplete"
brew "zsh-syntax-highlighting"
brew "powerlevel10k"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-for-powerlevel10k"
cask "font-meslo-for-powerline"
cask "font-meslo-lg-nerd-font"

# macOS apps

# Password manager that keeps all passwords secure behind one password
# cask "1password"

# Collection of apps and services for photography, design, video, web, and UX
# cask "adobe-creative-cloud"

# Enable Windows-like alt-tab
# cask "alt-tab"

# Application uninstaller
# cask "appcleaner"

# Multi-cloud backup application
# cask "arq"

# Runbook editor for terminal workflows
# cask "atuin-desktop"

# Tool to flash OS images to SD cards & USB drives
# cask "balenaetcher"

# Menu bar icon organiser
# cask "bartender"

# Desktop password and login vault
# cask "bitwarden"

# Send any size file between devices
# cask "blip"

# Utility to disconnect all drives connected to a Caldigit dock
# cask "caldigit-docking-utility"

# Hard disk backup and cloning utility
# cask "carbon-copy-cloner"

# Desktop app for GPT-4 / GPT-3.5 (OpenAI API)
# cask "chatbox"

# OpenAI's official ChatGPT desktop app
# cask "chatgpt"

# OpenAI's official browser with ChatGPT built in
# cask "chatgpt-atlas"

# Tool to remove unnecessary files and folders from disk
# cask "cleanmymac"

# Screen capturing tool
# cask "cleanshot"

# Application window manager focusing on simplicity
# cask "divvy"

# Window peeking utility app
# cask "dockdoor"

# File sharing solution
# cask "dropshare"

# Cross-platform Text Expander written in Rust
# cask "espanso"

# Web browser
# cask "firefox"

# GIT client
# cask "fork"

# Terminal emulator that uses platform-native UI and GPU acceleration
# cask "ghostty"

# Desktop client for GitHub repositories
# cask "github"

# Web browser
# cask "google-chrome"

# Companion app for Home Assistant home automation software
# cask "home-assistant"

# Tool to optimise images to a smaller size
# cask "imageoptim"

# Menu bar calendar
# cask "itsycal"

# Remote desktop application
# cask "jump-desktop"

# Remote desktop app
# cask "jump-desktop-connect"

# Spot and merge differences in text and image files or folders
# cask "kaleidoscope"

# File archiver
# cask "keka"

# Host-based application firewall
# cask "little-snitch"

# Display technical and tag data for video and audio files
# cask "mediainfo"

# Multi-platform web browser
# cask "microsoft-edge"

# Window dimming utility
# cask "monocle-app"

# Rename a list of files quickly
# cask "namechanger"

# Handy utility to manage and customize the notch area
# cask "notchnook"

# Replacement for Docker Desktop
cask "orbstack"

# Collaboration platform for API development
# cask "postman"

# All-in-one bookmark manager
# cask "raindropio"

# Imaging utility to install operating systems to a microSD card
# cask "raspberry-pi-imager"

# Move and resize windows using keyboard shortcuts or snap areas
# cask "rectangle"

# Music streaming service
# cask "spotify"

# System monitor for the menu bar
# cask "stats"

# Window manager
# cask "swift-shift"

# Easiest, most secure way to use WireGuard and 2FA
# cask "tailscale"

# Messaging app with a focus on speed and security
# cask "telegram"

# Unpacks archive files
# cask "the-unarchiver"

# Time tracking aided by a physical device
# cask "timeular"

# To-do list
# cask "todoist-app"

# Open-source BitTorrent client
# cask "transmission"

# File transfer application
# cask "transmit"

# Configurable document editor that supports Markdown
# cask "typora"

# Turn websites into apps
# cask "unite"

# Tool to hide menu bar icons
# cask "vanilla"

# Disk encryption software focusing on security based on TrueCrypt
# cask "veracrypt"

# Open-source code editor
# cask "visual-studio-code"

# Open-source code editor
# cask "visual-studio-code@insiders"

# visual-studio-code@insiders
# cask "vlc"

# Themes/Extensions for VS Code
# vscode "aaron-bond.better-comments"
# vscode "akamud.vscode-theme-onedark"
# vscode "akamud.vscode-theme-onelight"
vscode "alefragnani.bookmarks"
# vscode "astro-build.astro-vscode"
# vscode "azemoh.one-monokai"
vscode "bbenoist.nix"
# vscode "bmewburn.vscode-intelephense-client"
# vscode "bradlc.vscode-tailwindcss"
# vscode "danielsanmedium.dscodegpt"
vscode "dbaeumer.vscode-eslint"
# vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
# vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
# vscode "gruntfuggly.todo-tree"
# vscode "hookyqr.minify"
# vscode "kdcro101.favorites"
# vscode "kodu-ai.claude-dev-experimental"
vscode "mechatroner.rainbow-csv"
# vscode "meezilla.json"
vscode "mikestead.dotenv"
# vscode "morgan-codes.morgan-codes-vscode-theme"
# vscode "mrmlnc.vscode-json5"
# vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode-remote.remote-ssh"
# vscode "ms-vscode-remote.remote-ssh-edit"
# vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
# vscode "ms-vscode.remote-explorer"
# vscode "ms-vscode.remote-server"
# vscode "natizyskunk.sftp"
# vscode "oderwat.indent-rainbow"
# vscode "phgn.vscode-starlark"
# vscode "rangav.vscode-thunder-client"
# vscode "ricardomfmsousa.chordpro"
# vscode "ritwickdey.liveserver"
vscode "ronnidc.nunjucks"
# vscode "shakram02.bash-beautify"
# vscode "sleistner.vscode-fileutils"
# vscode "stylelint.vscode-stylelint"
# vscode "svelte.svelte-vscode"
# vscode "tamasfe.even-better-toml"
# vscode "tombonnike.vscode-status-bar-format-toggle"
# vscode "tyriar.lorem-ipsum"
# vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
# vscode "whatwedo.twig"
# vscode "whizkydee.material-palenight-theme"
# vscode "zhuangtongfa.material-theme"